part of 'main.dart';

final _todayShoppingCategories = ['멘즈', '우먼', '잇걸'];

final _todayShoppingList = {
  '멘즈': {
    'Image': [
      ['assets/a10913136.jpg', '오늘 단 하루! 레고 전 품목 최대 50% 파격가'],
      ['assets/a10913136.jpg', '품절주의 XBOX S 시리즈 X | S 콘솔 예약 판매'],
      ['assets/a10913136.jpg', '추가 쿠폰 Z플립까지 되는 괴물 충전'],
      ['assets/a10913136.jpg', '바쏘옴므 신상 캐시미어 카디건 71%↓ 3만원대']
    ],
    'Text': [
      [Icons.add, '추가 쿠폰 더', '마감임박!'],
      [Icons.new_releases, '신상WEEK', '단독 런칭! 36,900원'],
      [Icons.calculate, '15%+10%↓', '셀럽들도 많이 신는 신상']
    ]
  },
  '우먼': {
    'Image': [
      ['assets/a10913136.jpg', 'GNM 자연의 품격 헬시템 ~50%↓'],
      ['assets/a10913136.jpg', '~53%↓ 하기스 네이처메이드 파격가'],
      ['assets/a10913136.jpg', '마크모크 특가 DAY! 90% 할인'],
      ['assets/a10913136.jpg', '밀크마일 겨울 아우터 22종 77%↓']
    ],
    'Text': [
      [Icons.style, '뜨는 스타일 모음', '구경만 해도 센스 업그레이드'],
      [Icons.thumb_up, '후기 극찬', '당도 좋은 베니 하루카 고구마 30%↓'],
      [Icons.new_releases, '신상WEEK', '에뛰드 홀리데이 스페셜 단독 혜택'],
    ]
  },
  '잇걸': {
    'Image': [
      ['assets/a10913136.jpg', '국민템! 루나 컨실러+증정 34%↓'],
      ['assets/a10913136.jpg', '백화점 최신상! 어제의 VMD 모음'],
      ['assets/a10913136.jpg', '다이슨 UP TO 39% SALE'],
    ],
    'Text': [
      [Icons.thumb_up, '이런 코디 칭찬해', '입는 순간 비주얼 담당은 나야 나'],
      [Icons.food_bank, '후기 1만 개⬆', '원액만! 리얼 깔라만시X25팩 13%'],
    ]
  },
};

final _trendList = [
  [
    ['assets/a10913136.jpg', '상품 설명1-1'],
    ['assets/a10913136.jpg', '상품 설명1-2'],
    ['assets/a10913136.jpg', '상품 설명1-3'],
    ['assets/a10913136.jpg', '상품 설명1-4'],
    ['assets/a10913136.jpg', '상품 설명1-5'],
    ['assets/a10913136.jpg', '상품 설명1-6']
  ],
  [
    ['assets/a10913136.jpg', '상품 설명2-1'],
    ['assets/a10913136.jpg', '상품 설명2-2'],
    ['assets/a10913136.jpg', '상품 설명2-3'],
    ['assets/a10913136.jpg', '상품 설명2-4'],
    ['assets/a10913136.jpg', '상품 설명2-5'],
    ['assets/a10913136.jpg', '상품 설명2-6']
  ],
  [
    ['assets/a10913136.jpg', '상품 설명3-1'],
    ['assets/a10913136.jpg', '상품 설명3-2'],
    ['assets/a10913136.jpg', '상품 설명3-3'],
    ['assets/a10913136.jpg', '상품 설명3-4'],
    ['assets/a10913136.jpg', '상품 설명3-5'],
    ['assets/a10913136.jpg', '상품 설명3-6']
  ],
  [
    ['assets/a10913136.jpg', '상품 설명4-1'],
    ['assets/a10913136.jpg', '상품 설명4-2'],
    ['assets/a10913136.jpg', '상품 설명4-3'],
    ['assets/a10913136.jpg', '상품 설명4-4'],
    ['assets/a10913136.jpg', '상품 설명4-5'],
    ['assets/a10913136.jpg', '상품 설명4-6']
  ],
];

final _otherCategories = [
  [
    '패션/뷰티',
    ['백화점윈도', '아울렛윈도', '스타일윈도', '뷰티윈도', '브랜드관', '디자이너윈도', '해외직구']
  ],
  [
    '라이프',
    ['리빙윈도', '키즈윈도', '펫윈도', '문방구']
  ],
  [
    '푸드/헬시',
    ['푸드윈도', '장보기', '산지직송', '지역명물', '헬시윈도', '브랜드장보기', '간편집밥', '전통주']
  ],
  [
    '테크/취미',
    ['플레이윈도', '아트윈도', '창작공방']
  ],
  [
    '기타',
    ['핫딜', '럭키투데이', '타임특가']
  ],
];
